import 'package:dartz/dartz.dart';
import 'package:my_books/models/book.dart';

import '../../core/logic/failure.dart';

class BooksRepoImp  {

  Future<Either<List<Book>, Failure>> getBooks() async {
    await Future.delayed(const Duration(seconds: 2));
    List<Book> list = [
      Book(
          id: 0,
          isFav: true,
          name: "حكايات الغرفة 207 ",
          description:
              'يقول ستيفن كنج : " بالإضافة إلي قصص دفن الأحياء ، علي كل كاتب رعب أن يقدّم قصة واحدة علي الأقل عن غرف الفنادق المسكونة ، لأن غرف الفنادق أماكن مخيفة بطبعها . تخيل كم من الناس نام في الفراش قبلك ؟ كم منهم كان مريضاً ؟ كم كمهم كان يفقد عقله ؟ كم منهم كان يفكر في قراءة بضع آيات أخيرة من الكتاب المقدس الموضوع في درج الكومود بجوار الفراش قبل أن يشنق نفسه في خزانة الملابس بجوار التليفزيون ؟ بالفعل غرف الفنادق أماكن مرعبة . وأكثرها إرعاباً هي الغرفة 207 .. في هذه الغرفة تحتشد أشنع مخاوفك التي داريتها حتي عن نفسك منذ كنت طفلاً .. في هذه الغرفة يتلاشي الحاجز بين الحقيقة والوهم .. بين المخاوف المشروعة والكابوس .. في هذه الغرفة يتلاشي الحاجز بين الماضي والمستقبل .. وبين ذاتك والآخرين .. لا تتلصص ولا تختلس النظر عبر ثقب المفتاح .. فقط فلتدر مقبض الباب في هدوء وحذر .. ولتدخل الغرفة رقم 207',
          image:
              "https://www.noor-book.com/publice/covers_cache_webp/6/f/c/9/7eadee767efc9248c217c606424f70a4.png.webp"),
      Book(
          id: 1,
          isFav: false,
          name: "لتكن مختلفاً ",
          description:
              'محتوى كتابي يسعى لتطوير وتغيير الأفكار يجعل الإنسان ذو إختلافاً مُبهر مليئ بالخيال والواقع وسائد فيه الغموض والوضوح أقرا بنفسك الكتاب تكتشف حقيقته!',
          image:
              "https://www.noor-book.com/publice/covers_cache_webp/2/a/b/f/85576040dfabf65050c7ee713a888409.jpg.webp"),
      Book(
          id: 2,
          isFav: false,
          name: "صاحب الظل الطويل ",
          description:
              'صاحب الظل الطويل أو أبي طويل الساقين، هي رواية للكاتبة الأمريكية جين ويبستر. تدور أحداث القصة حول فتاة يتيمة اسمها جودي أبوت، التي تحصل على منحة للدراسة في مدرسة لينكولن الثانوية من قبل شخص لا تعرفه، اسمه المستعار هو جون سميث وقد ابتكرت له اسم "صاحب الظل الطويل" فهي لم تستطع أن تراه وتشكره، فقط رأت ظله الطويل. المقابل الوحيد الذي اشترطه سميث على جودي مقابل المنحة هو أن تقوم بمراسلته مرة واحدة كل شهر، بدون أن تتوقع رداً منه على رسائلها بالضرورة. القصة تروي تفاصيل ثلاث سنوات من حياة جودي، ابتداءً من مغادرتها لدار الأيتام وحتى تخرجها من المدرسة الثانوية. وتدور القصة حول شخصيات الرواية الأهم: جودي أبوت: وهي فتاة ذكية ومرحة توفي والداها عندما كانت طفلة صغيرة ونشأت في دار للأيتام حيث طورت موهبتها في الكتابة، أحد مقالاتها تلفت انتباه جون سميث (صاحب السيقان الطويلة) وتؤدي إلى حصولها منه على منحة إلى مدرسة لينكولن الثانوية حيث تتعرف هناك على صديقتيها سالي ماكبرايد وجوليا بندلتون.',
          image:
              "https://www.noor-book.com/publice/covers_cache_webp/9/3/0/a/06482c5be730a804000c69f2693f017a.png.webp"),
      Book(
          id: 3,
          isFav: true,
          name: "العادات الذرية ",
          description:
              'يعد هذا الكتاب للكاتب جيمس كلير منهج سهل لبناء عادات جيدة والتخلص من العادات السيئة، ويقدم لنا إطار عمل أياً كانت أهدافنا، من أجل تطوير مهاراتنا في كل يوم. جيمس كلير واحد من أبرز الخبراء في مجال اكتساب العادات، ويوضح لنا هنا استراتيجيات عملية، تعلمنا كيف نستطيع اكتساب عادات جيدة، وكيف نتخلص من القديمة السلبية، كما يشرح لنا طريقة إدارة وإتقان أفعالنا اليومية البسيطة، التي نستطيع من خلالها تحقيق نتائج مذهلة، وكيف نخلق الوقت لاكتساب العادات، وكيف نتخلص من نقص الحافز، وأن نتمتع بقوة الإرادة كيف نغير بيئتنا. يرتبط الكتاب بتجربة صاحبه المحيطة لتحقيق نتائج إيجابية في الحياة، ومن ثم صقلاً لتكون له أسلوب حياة، وعندما يعنونها بالذرية فإنه يقصد المقدار التراكمي للذرة الصغيرة لتصبح كتلة، ويقول الكاتب أنه عندما يكون لدينا توقٌ في إنجاز هدفٍ معين (إنقاص وزن، تأليف كتاب، لياقة بدنية عالية)، يجب أن ننشئ عادة متراكمة لهذا الفعل، لأن الهدف قد يتحقق ومن السهل فقدانه، متى ما أنهينا العادة ورجعنا لنفس الأسلوب، بمعنى قد نستطيع تحديد هدفنا بإنزال وزننا في فترة وجيزة، ولكن بمجرد تخلينا عن هذه العادات الصحية، فسرعان ما يعود الوزن إلى عهده السابق. يتطرق الكتاب إلى استراجيات مقرونة بقصص وبراهين كتبت بأسلوب شيق ونقاط محددة وواضحة لتغيير الاتجاهات والعادات السيئة . "الناجحونَ والفاشلونَ لديهم نفسُ الأهدافِ، كلُّ رياضيٍّ في الأولمبيادِ يريدُ الفوزَ بميداليةٍ ذهبيةٍ، ولكنْ وحدَهُ النظامُ الذي يتبِعُه الناجحونَ هو ما يعطِيهمُ أفضلَ النتائجِ، وليسَ أهدافَهم، العاداتُ الذريةُ هي عاداتٌ ضئيلةٌ جدًّا؛ كذَراتٍ صغيرةٍ ولكنها قويةٌ، وتصبحُ أكثرَ قوةً بتَكرارِها لمئاتِ وآلافِ المراتِ، فالعاداتُ الصغيرةُ يمكنُ مراكمَتُها على مدارِ الوقتِ" حيثُ يصفُها كلير بأنها "تراكمٌ للتطورِ الذاتيِّ" فأثرُ العاداتِ يتضاعفُ بالتَكرارِ، قد لا يظهرُ أيُّ اختلافٍ في يومٍ أو في عدةِ أيامٍ، ولكنْ بمرورِ الشهورِ والأعوامِ يكونُ التغييرُ ضخمًا.',
          image:
              "https://www.noor-book.com/publice/covers_cache_webp/13/c/c/9/6026d9af14cc9f0e28229128f9db28f5.png.webp"),
      Book(
          id: 4,
          isFav: false,
          name: "تعليم القراءة والكتابة تأسيس ",
          description:
              "من مميزات هذه المذكرة أنها تستطيع أن تعلمك القراءة والكتابة بإذن الله لأنها مجربةوجابت نتائج ممتازة مع كل من يريد تعلم اللغة وهذا كله من فضل ربي (اللهم زدني علما)",
          image:
              "https://www.noor-book.com/publice/covers_cache_webp/2/c/b/8/033cde8456cb835f483d8ea6ccf0cb3a.jpg.webp"),
      Book(
          id: 5,
          isFav: false,
          name: "الرجال من المريخ والنساء من الزهرة ",
          description:
              "الرجال من المريخ والنساء من الزهرة كتاب من تأليف الطبيب النفسي الأمريكي جون غراي صدر في مايو 1992 وفيه يتناول المشاكل التي قد تحدث بين الرجل والمرأة نتيجة الاختلافات بينهم. وترجم إلى عدد كبير من اللغات، وبيعت منه ملايين النسخ. يتكون الكتاب من 13 فصلا كتبت بأسلوب بسيط ومناسب لكافة أنواع القراء. من مقدمة الكتاب تخيل أن الرجال من المريخ والنساء من الزهرة، وفي أحد الأيام منذ زمن بعيد كان أهل المريخ ينظرون من خلال مناظيرهم المقربة واكتشفوا أهل الزهرة.وبلمحة خاطفة أيقظ أهل الزهرة مشاعر لم يكن لأهل المريخ بها عهد. لقد وقعوا في الحب واخترعوا بسرعة سفن فضائية وطاروا للزهرة . فتح أهل الزهرة أذرعتهم ورحبوا بأهل المريخ . كانوا بفطرتهم يعرفون أن هذا اليوم سيأتي. وتفتحت قلوبهم على مصراعيها لحب لم يشعروا به قط من قبل . لقد كان الحب بينهم سحرياً وكانوا مسرورين للغاية لوجودهم مع بعض على الرغم من أنهم من عوالم مختلفة فقد وجدوا المتعة على الرغم من اختلافاتهم . وقضوا شهوراً يتعلمون عن بعضهم ويستكشفون حاجاتهم المختلفة وتفضيلاتهم وأنماطهم السلوكية ويقدرونها حق قدرها . ثم قرروا السفر للأرض كان كل شيء مدهشا وجميلا ولكن تأثير جو الأرض غلب عليهم واستيقظوا وكل واحد منهم يعاني من نوع معين من فقدان الذاكرة، فقدان الذاكرة الاختياري نسوا أنهم من عوالم مختلفة . ونسوا ما تعلموه عن اختلافاتهم، ومنذ ذلك اليوم كان الرجال والنساء على خلاف. فصول الكتاب الرجال من المريخ، النساء من الزهرة. السيد الخبير ولجنة تحسين البيت. يذهب الرجال إلى كهوفهم وتتحدث النساء. كيف تحفز الجنس الآخر؟ التحدث بلغات مختلفة. الرجال مثل الأحزمة المطاطية. النساء مثل الأمواج. استكشاف حاجاتنا العاطفية المختلفة. كيف تتفادى المجاملات؟ إحراز النقاط مع الجنس الآخر. كيف تنقل للآخرين مشاعر سيئة؟ كيف تطلب الدعم وتحصل عليه؟ الإبقاء على سحر الحب حيا. اختلاف الطبائع بين الرجال والنساء يعرض الكاتب اختلاف الطبائع بين سكان المريخ (الرجال) وسكان الزهرة (النساء) فيعرض الحياة علي سطح المريخ (بدون نساء)، والحياة علي سطح الزهرة (بدون رجال) ومن الطبائع التي عرضها الكاتب في كتابه: حاجة الرجال والنساء الرجال يحتاجون أن يشعروا بأن هناك من يحتاج إليهم، ويحتاج النساء إلى أن يشعرن بأنهن معززات نتيجة 1: يحتاج الرجال إلي الثقة والتقبّل، بينما تحتاج النساء إلي الرعاية والتقدير نتيجة 2: لا يقبل الرجل النصيحة لأنه ذم في قدراته، ولا تقبل النساء مقاطعتها وتقديم حلول أثناء حديثها لأنه يعني عدم الاهتمام بمشاعرها حديث المرأة معظم حديث المرأة عن مشاعرها نتيجة 1: حديث المرأة يحمل طلباتها بشكل غير مباشر (مثلاً: عندما تقول: انا أشعر بضيق. الترجمة: أريد أن نأخذ إجازة) نتيجة 2: طالما حديث المرأة عن مشاعرها فطبيعي أن تبالغ أو تعظم من الأمور الصغيرة ولا تعني إطلاقاً ما تقوله حرفياً الرجال مثل الأحزمة المطاطية الرجال مثل الأحزمة المطاطية ؛ يقترب وينسحب إلي كهفه (الكهف عند الرجل يعني العزلة) لأنه يحتاج إلي الحب والاستقلالية من حين لآخر نتيجة 2: عندما يدخل الرجل إلي كهفه، فلا تحاولي الحديث معه واتركيه. المرأة مثل الأمواج المرأة مثل الأمواج ؛ يشعرن أحياناً بالسعادة (قمة الموجة) وأحياناً بالحزن (القاع)، وأثناء حزنها يجب عليك ألا تصلحها بل المطلوب أن تتفهمها (استمع إليها بإنصات دون تقديم حلول) طبيعة الجدال عند الرجال والنساء الجدال غالباً علي طريقة الكلام وليس الموضوع أخطاء الرجال عند الجدال: القتال: أنتِ سبب الخطأ الهروب: أنا بريء أخطاء النساء: التظاهر: إخفاء الغضب التطويق: الاستسلام بأن الرجل علي حق بدل الجدال حساب المرأة لأعمال الرجل عند المرأة كل الأعمال لها نفس القدر ؛ فعملك 15 ساعة كي تحضر مال للبيت يساوي هدية صغيرة، لذلك فاهتم بالأعمال الصغيرة (وردة، سفره، هدية ..الخ)",
          image:
              "https://www.noor-book.com/publice/covers_cache_webp/1/4/7/3/a25e0656b24730d84c9d265ac4657f1f.jpg.webp")
    ];
    bool isSuccess = true;

    if (isSuccess) {
      return Left(list);
    } else {
      return Right(Failure("Failed"));
    }
  }
}
